// Дано двузначное число. Выведите его первую цифру (число десятков)
// На вход дается натуральное двузначное число N.

#include <iostream>
using namespace std;
int main()
{
    int k;
    cin >> k;
    cout << k/10 << endl;
    return 0;
}